#include <stdio.h>

#define M 10
#define N 3

//挺好的思路，不过真的难看懂
//此处简略介绍

//	1. 开始时数组 a[] 中存了每个人的编号(1,2,3,...)
//	2. 数数j，从1到N，若超过了但前有的人数，则回到 0	//j就相当与数组的下标，就是剩余人数重新排列的顺序
//	3. 数数到N时，将此时a[j]存到b，
//	4. 然后相当于删除a[j],就是将数组后面的数（人员的编号）前进一步，覆盖a[j]
//	5. 同时i--，则剩余人数减少



int main(void) {
    int a[M], b[M];
    int i, j, k;

    for (i = 0; i < M; i++)
        a[i] = i + 1;

    for (i = M, j = -1; i >=1; i--) {		//注意数组下标与元素的关系
        for (k = 1; k <= N; k++) {
            if (++j >= i) j = 0;
        }
        b[M - i] = a[j];
        for (k = j; k < i - 1; k++)			//相当于删掉a[j]上的人
            a[k] = a[k + 1];
			j--;		
    }
	
	
    for (i = 0; i < M - 1; i++)
        printf("%6d", b[i]);

    printf("\n%6d\n", a[0]);

    return 0;
}
